In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("carRecords.csv",index_col=0)

In [5]:
df.head()

   type  year                 title      trim     price  mileage
0  used  2017       Hyundai Accent        SE    13879.0      168
1  used  2015      Chevrolet Sonic       LTZ     8990.0    49000
2  used  2001   Mitsubishi Montero   Limited     7995.0   130752
3  used  2012             Scion xB      Base    11995.0    51947
4  used  2007  Rolls-Royce Phantom      Base   139999.0    14796

In [6]:
df['make'], df['model'] = df['title'].str.split(' ', 1).str

In [9]:
df.head()

,type,year,title,trim,price,mileage,make,model
0,used,2017,Hyundai Accent,SE,13879.0,168,Hyundai,Accent
1,used,2015,Chevrolet Sonic,LTZ,8990.0,49000,Chevrolet,Sonic
2,used,2001,Mitsubishi Montero,Limited,7995.0,130752,Mitsubishi,Montero
3,used,2012,Scion xB,Base,11995.0,51947,Scion,xB
4,used,2007,Rolls-Royce Phantom,Base,139999.0,14796,Rolls-Royce,Phantom

In [11]:
df = df.drop(['title'], axis=1)
df.head()

   type  year      trim     price  mileage         make     model
0  used  2017       SE    13879.0      168      Hyundai   Accent
1  used  2015      LTZ     8990.0    49000    Chevrolet    Sonic
2  used  2001  Limited     7995.0   130752   Mitsubishi  Montero
3  used  2012     Base    11995.0    51947        Scion       xB
4  used  2007     Base   139999.0    14796  Rolls-Royce  Phantom

In [12]:
df.to_csv("carRecordsCleaned.csv")

In [17]:
df['model'].nunique()

488

In [18]:
df['year'].nunique()

28